acp_mrw/mrw/template/picking_send.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:mrw="http://www.mrw.es/">
   <soap:Header>
      <mrw:AuthInfo>
         <mrw:CodigoFranquicia>${franchise}</mrw:CodigoFranquicia>
         <mrw:CodigoAbonado>${subscriber}</mrw:CodigoAbonado>
         <mrw:CodigoDepartamento>${department}</mrw:CodigoDepartamento>
         <mrw:UserName>${username}</mrw:UserName>
         <mrw:Password>${password}</mrw:Password>
      </mrw:AuthInfo>
   </soap:Header>
   <soap:Body>
      <mrw:TransmEnvio>
         <mrw:request>
            <mrw:DatosEntrega>
               <mrw:Direccion>
                  <mrw:CodigoDireccion>${codigo_direccion}</mrw:CodigoDireccion>
                  <mrw:CodigoTipoVia>${codigo_via}</mrw:CodigoTipoVia>
                  <mrw:Via>${via}</mrw:Via>
                  <mrw:Numero>${numero}</mrw:Numero>
                  <mrw:Resto>${resto}</mrw:Resto>
                  <mrw:CodigoPostal>${codigo_postal}</mrw:CodigoPostal>
                  <mrw:Poblacion>${poblacion}</mrw:Poblacion>
                  <mrw:Provincia>${provincia}</mrw:Provincia>
                </mrw:Direccion>
               <mrw:Nif>${nif}</mrw:Nif>
               <mrw:Nombre>${nombre}</mrw:Nombre>
               <mrw:Telefono>${telefono}</mrw:Telefono>
               <mrw:Contacto>${contacto}</mrw:Contacto>
               <mrw:ALaAtencionDe>${atencion_de}</mrw:ALaAtencionDe>
               <mrw:Observaciones>${observaciones}</mrw:Observaciones>
            </mrw:DatosEntrega>
            <mrw:DatosServicio>
               <mrw:Fecha>${fecha}</mrw:Fecha>
               <mrw:Referencia>${referencia}</mrw:Referencia>
               <mrw:EnFranquicia>${enfranquicia}</mrw:EnFranquicia>
               <mrw:CodigoServicio>${codigo_servicio}</mrw:CodigoServicio>
               <mrw:NumeroBultos>${bultos}</mrw:NumeroBultos>
               <mrw:Peso>${peso}</mrw:Peso>
               <mrw:EntregaSabado>${entregasabado}</mrw:EntregaSabado>
               <mrw:Reembolso>${reembolso}</mrw:Reembolso>
               <mrw:ImporteReembolso>${importe_reembolso}</mrw:ImporteReembolso>
            </mrw:DatosServicio>
         </mrw:request>
      </mrw:TransmEnvio>
   </soap:Body>
</soap:Envelope>
